#+Title: Programming Fundamentals Lab Week 5
#+Author: Hamza Shahid
#+Date: <2024-09-29 Sun>

** Ternary Sign of Number
#+begin_src C
  #include<stdio.h>

  int main() {
      printf("Please enter a number: ");
      int num = 0;
      scanf("%d", &num);

      char* sign = num == 0 ? "zero" : (num < 0 ? "negative" : "positive");
      printf("Your number is %s\n", sign);
      
      return 0;
  }
#+end_src

#+RESULTS:
: Please enter a number: Your number is zero

** On Bit Counter
#+begin_src C
  #include<stdio.h>

  int main() {
      printf("Please enter a number: ");
      int a = 0;
      scanf("%d", &a);

      int count = 0;
      for (int i = 0; i < sizeof(a)*8; i++) {
          count += (a & (1 << i)) >> i; // Kinda proud of writing this myself not gonna lie
      }
      
      printf("There are %d ones in the binary representation of your number.\n", count);
      
      return 0;
  }
#+end_src

#+RESULTS:
: Please enter a number: There are 0 ones in the binary representation of your number.

